IDEA StatiCa Open Model
ThermalStressStrainState Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of curvature - thermal stress-strain curvature
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ThermalStressStrainState
Public Enumeration ThermalStressStrainState
public enum class ThermalStressStrainState
Members
Member name | Value | Description
None | 0 |  The curvature is not defined
Code | 1 |  The curvatire is defined by the code
User | 5 |  The curvature is input by the user
See Also
Reference
IdeaRS.OpenModel.Material Namespace